import { ProgramType } from "../../types";

export const pushup50_30: ProgramType = {
    id: 'pushup50_30',
    title: '50 отжиманий за 30 дней',
    rules: `Основные правила:
    Делаем необходимое количество отжиманий согласно графика.
    Отдых между повторами 1-2 минуты.
    Каждый подход фиксируется на видео и отправляется в чат.
    Если до 12 вечера видео не загружено, это штрафной балл.
    За всю программу разрешен только один штрафной. Два нарушения - дисквалификация.
    По итогу должны быть закрыты все даты по календарю. Если день пропустили, то закрываем сначала пропуск, потом продолжаем.
    Требования к отжиманиям:
    Тело ровно, жопу не выпячивать, руки сгибаем в локтях до 90 градусов.`,
    schedule: [
        {day: 1, exercise: 'Отжимания 3 подхода: 4, 2, 2'},
        {day: 2, exercise: 'Отжимания 3 подхода: 6, 2, 2'},
        {day: 3, exercise: 'Планка 2 подхода по 10 секунд'},
        {day: 4, exercise: 'Отжимания 3 подхода: 8, 4, 2'},
        {day: 5, exercise: 'Отжимания 3 подхода: 10, 4, 4'},
        {day: 6, exercise: 'Отжимания 3 подхода: 10, 6, 4'},
        {day: 7, exercise: 'Планка 3 подхода по 15 секунд'},
        {day: 8, exercise: 'Отжимания 3 подхода: 12, 4, 4'},
        {day: 9, exercise: 'Отжимания 3 подхода: 14, 6, 4'},
        {day: 10, exercise: 'Отжимания 3 подхода: 16, 6, 4'},
        {day: 11, exercise: 'Планка 3 подхода по 20 секунд'},
        {day: 12, exercise: 'Отжимания 3 подхода: 16, 8, 5'},
        {day: 13, exercise: 'Отжимания 3 подхода: 16, 10, 5'},
        {day: 14, exercise: 'Отжимания 3 подхода: 18, 12, 5'},
        {day: 15, exercise: 'Планка 4 подхода по 20 секунд'},
        {day: 16, exercise: 'Отжимания 3 подхода: 20, 10, 5'},
        {day: 17, exercise: 'Отжимания 3 подхода: 22, 10, 5'},
        {day: 18, exercise: 'Отжимания 3 подхода: 24, 12, 8'},
        {day: 19, exercise: 'Планка 5 подхода по 20 секунд'},
        {day: 20, exercise: 'Отжимания 3 подхода: 26, 14, 8'},
        {day: 21, exercise: 'Отжимания 3 подхода: 26, 15, 5'},
        {day: 22, exercise: 'Отжимания 3 подхода: 26, 15, 10'},
        {day: 23, exercise: 'Планка 5 подхода по 25 секунд'},
        {day: 24, exercise: 'Отжимания 3 подхода: 28, 15, 10'},
        {day: 25, exercise: 'Отжимания 3 подхода: 30, 15, 15'},
        {day: 26, exercise: 'Отжимания 3 подхода: 35, 15, 5'},
        {day: 27, exercise: 'Планка 6 подхода по 25 секунд'},
        {day: 28, exercise: 'Отжимания 3 подхода: 40, 15, 5'},
        {day: 29, exercise: 'Планка 6 подхода по 30 секунд'},
        {day: 30, exercise: 'Отжимания 1 подход: 50'},
    ]
}
